{
    "id": 1,
    "title": "The Pirate's Captive",
    "content": "Chapter 1\n\n\n\nMima is a young girl who has just started her first job fresh out of university, she was a bit shy, still waiting for the life to hit her, but somehow full of life. She was born in a small town of west end American mountains. She had spent most of her childhood in big cities and still being somewhat unseen by the crowds and a little but of her university life in a samller town but yet very well touched and understood by the people. She had a very loving mother, somehow a tolerable brother and a very strict father. \n\n\n\nIt was middle of the year of 2024 when her family planned a cruise trip. It was a all round trip stopping at various places in the south of europe, she was looking forward to it. \n\nAs the time of the trip came closer she got more and more excited, “eh, finally something of a new varient in this life”, she said to herself. \n\nAlthough her life was not a boring life, she had friends, she did yoga, had an active social life since she moved to the new town but still something felt missing. \n\n\n\nThe soon the time passed and the time of the cruise came. They reached a small town named Kalamata in south of Greece. The cruise was supposed to be fourteen day cruise starting from Greece and ending all the way to Los Muertos in Spain. Her family reached Kalamata one day prior to the day of boarding the cruise, she was excited, she wasn’t the kind of girl who would post an update on social media as soon as she did something new in her life, in fact she was deeply introverted person who rarely allowed anyone to know her , her close group of friends and her mother knew most about her, even her own father was mostly unknown with the kind of storms her quite unnoticed heart goes from time to time.\n\n\n\nChapter 2\n\n\n\nThe day they boarded the cruise, the sea was calm and the sun seemed gentler than usual, as if it too was preparing for something. Mima stood at the deck in her linen trousers and oversized sunglasses, her headphones resting lightly around her neck. Her family was inside, fussing over lunch options, but she remained outside, quietly taking in the vastness of the sea.\n\nThere was something about the horizon that made her heart ache—not with sadness, but with a longing she couldn’t place. It wasn’t new. She had always felt things a bit deeper than others, a little more layered. She watched the waves, their endless rolling, and felt a strange pull in her chest—as if something out there recognized her.\n\nThat evening, they docked briefly at a small, lesser-known coastal village in eastern Albenia. Tourists weren’t many, and the locals, weathered but warm, carried baskets of fruit and wine through narrow cobbled streets. Mima wandered off, as she often did, promising to be back before dinner. Her mother smiled softly at her, used to her daughter’s dreamy detours.\n\nShe found herself following a narrow path that led to the edge of the cliff. Below, hidden from most of the town’s view, lay a quiet cove with emerald waters. And anchored just a little way from the shore was a ship, not like the usual cruise liners, not even like a yacht.\n\nIt was beautiful, though old. Sleek and dark with gold accents. The sails were drawn but shimmered oddly against the twilight. The ship looked like it had no place in this century.\n\nAnd then she saw him.\n\nOn the deck stood a man in a long coat. He wasn’t waving, wasn’t calling. He was simply watching her as if he had known she would come. As if he’d been waiting.\n\nA strange warmth filled her chest, and the world seemed to hush for a moment. No birds. No breeze. Just the soft hiss of the tide below.\n\nAfter a while, Mima went to buy some oranges from the local market. She liked eating fruits—especially on warm days like this. As she sorted through a crate, one of the oranges slipped from her hand and rolled away.\n\nShe bent to pick it up, but another hand reached it first.\n\nIt was him.\n\nThe same man she had seen on the ship.\n\nHe said nothing. Just handed her the orange.\n\nMima froze for a second, caught off-guard. She hesitated but took it. And in doing so, she made the mistake of meeting his eyes.\n\nThere was nothing threatening in them—no smirk, no mischief. But there was a depth, an impossible stillness, like he had seen centuries pass and forgotten which ones mattered.\n\nBefore she could think, before she could speak or even thank him, he was gone. As if swallowed by the market itself.\n\nShe looked around, scanning faces and stalls, but the man had vanished into the noise and the color.\n\nYet the feeling remained.\n\nA quiet shift. Like something within her had been unlocked. Something that she hadn’t come in terms with yet.\n\nShe walked back to the cruise dock with the orange still in her hand.\n\nThat night, Mima couldn’t sleep. A low hum filled her dreams, and in them, she saw the same ship again—rocking gently on an endless sea of stars. The man stood at the helm, his coat fluttering soundlessly.\n\nHis voice—refined, patient—echoed like it came from the sea itself:\n\n“We come not for the willing, Mima. We come for the waiting.”\n\nThe next morning was a fast one, the cruise ship was destined to go to one of the very happening cities of the Italian coast.\n\nThe sun came bright and warm. The cabin curtains fluttered gently in the breeze, sunlight spilling across the wooden floor in golden lines. Mima woke with a soft smile, the remnants of her strange dream dissolving like sugar in tea.  She started preparing for all the things she was going to check off from her itinerary. She was excited again and looking forward to her day.\n\nToday, the cruise had docked at one of Italy’s most beautiful coastal towns. The sea sparkled like crushed glass. Tourists filled the streets, music played from open cafés, and the air smelled of citrus and sea salt.\n\nMima tied her hair up, slipped into a summer dress, and joined her family for breakfast on the upper deck. Her mother raved about the ceramics market, her brother teased her about her journal obsession, and even her father seemed unusually relaxed, sipping his espresso without a single complaint.\n\nEverything felt right.\n\nFull of promise.\n\nNew. Alive.\n\nThe air had a very shallow but very tangible sense of happiness in it.\n\nShe wandered the city with a small notebook in hand, sketching balconies and shopfronts. Bought postcards she’d never send. Tasted fig gelato from a cheerful old woman who insisted on giving her two scoops. The bells from a distant church rang out as she followed narrow cobbled streets, humming to herself. With all this , she decided to visit the beech.  The seashore wasn’t sandy, it was well paved, seemed as if a medium sized boat could easily dock there, she decided to take some pictures just for the sake of memory. Everything was going well, she had a smile on her face that she just couldn’t wipe off even if she tried.\n\nAnd then—\n\nEverything stopped.\n\nThe air snapped.\n\nThe warmth vanished in an instant, replaced by a deep, biting cold.\n\nThe world around her paused—the sounds of the city went mute, like someone had stuffed cotton into her ears. The crowd she had been walking through was suddenly gone.\n\nNo people.\n\nNo wind.\n\nNo sun.\n\nJust grey.\n\nA low sound began to rise behind her. Not music. Not voices.\n\nA hum.\n\nThe same one from her dreams—but louder now. Mechanical. Wet. Ancient.\n\nShe turned around—\n\nAnd the ship was there.\n\nMassive. Silent. Waiting.\n\nThe mist poured from beneath it, curling around her ankles, pulling at her feet like fingers. And at the top of the gangway stood some men. There was an air of harrowing and petrifying aura coming out of those men. As they came closer and closer, it was clear that their was no humanity left in them. Not fully.\n\n“Pirates!”, someone screamed from the background. The entire town’s mood behind her had shifted and she stood on the edge on the end, seeming as if on one side of her were these inhuman looking pirates and on the other end was that city where she was strolling just few minutes back. \n\nMima tried to run, she tried to scream.\n\nNothing came out.\n\nHer legs wouldn’t move—frozen.\n\nThe street, the bells, the sun—they were gone, like someone had torn a curtain from the stage.\n\nAll that remained was the ship.\n\nAnd the gruesome men who were operating it.\n\nShe somehow gathered the courage and started running away, tearing through the mist-choked air. Her sandals slapped against the cobblestones, lungs burning, heart screaming louder than her voice could. She didn’t care where she was going—just away. Away from the ship. From him.\n\nThen she heard it.\n\nThe thud.\n\nA heavy, hollow sound—like anchors dropping not on water, but on stone.\n\nShe turned a corner—and stopped dead.\n\nThe street she'd just passed through, vibrant just moments ago, was now drenched in a sickly gray haze. People were coughing. Stumbling. Some were already on the ground, limbs twitching, hands grasping at their throats.\n\nThen she saw them.\n\nPipes—thick, metallic hoses—snaking from the side of the ship and coiling through the mist, pumping out some kind of gas. Not thick enough to blind, but heavy enough to cling to the skin, to coat the lungs.\n\nIt smelled metallic. Acidic. Wrong.\n\nThe people caught in it first began to stagger. Then freeze. Not in some cinematic, magical way—but in the real, terrifying way a body shuts down under chemicals. Muscles locking. Joints refusing to obey. Screams cut short as mouths gaped but no air came in.\n\nA woman dropped to her knees beside a stroller, clawing at the air. A man in a hotel uniform keeled over, convulsing violently. Mima stared, numb, as a teenager tried to crawl across the pavement—only to be grabbed by two of the masked figures and hauled upright like cargo.\n\nThe pirates moved quickly.\n\nGas masks. Gloves. Tactical precision.\n\nNo yelling. No panic. Just action.\n\nThis was a practiced operation.\n\nMima turned and ran again—but her legs were already weakening. Her throat was raw, her head swimming. The gas was spreading fast, and the city had become a maze. She could hear others screaming now—farther off—cut off mid-cry, like someone flicking a switch.\n\nShe reached the edge of the old harbor. People were still there—fewer now. Staring. Some filming on their phones, unaware of how close they were to collapse.\n\nAnd then came the sound.\n\nA bell.\n\nNot from a church, but from the ship. Deep, guttural, mechanical—like a warning before a blast.\n\nAnd then they dropped canisters.\n\nMima watched them roll across the stone like forgotten soda cans—until they hissed. High-pitched. Violent.\n\nThe second wave of gas came sharper. Hotter. It hit the nerves directly. Mima fell to her knees, her hands shaking uncontrollably.\n\nAround her, people collapsed—one by one.\n\nSome tried to crawl. Others just twitched.\n\nHer vision blurred. She couldn’t move. Couldn’t scream. Her lungs were shutting down in slow motion.\n\nAnd then she saw them.\n\nComing from the fog.\n\nThe pirates. The same dark clothes. The same masks. Moving like a cleanup crew in a chemical zone. Checking pulses. Injecting something into necks. Tagging wrists with red tape. Hauling bodies, two at a time, into unmarked trucks backed up against the sea wall.\n\nMima’s last sight before she blacked out was a pair of black boots stopping inches from her face.\n\nThe hiss of a needle.\n\nThe click of plastic handcuffs.\n\nAnd the shape of the ship, still waiting, still silent—its belly open for cargo.\n\nChapter 3\n\nA harsh fluorescent light buzzed overhead.\n\nMima blinked—slowly, painfully. Her body was cold. Her mouth was dry. She couldn’t move much, but her eyes fluttered open enough to see a pale ceiling and metal rails on either side of her.\n\nShe was strapped to a gurney.\n\nThe room was sterile. Clinical. It smelled of antiseptic and blood—too much blood. Dim shadows moved beyond the bright light above her, shapes of people in surgical gear: masks, gloves, plastic aprons splattered with things she didn’t want to name.\n\nShe tried to sit up. Nothing happened.\n\nHer wrists and ankles were bound. Something tugged at the back of her hand—an IV line, which seemed wasn’t there to keep her healthy but to make sure she stayed in half sedated state. A monitor beeped nearby, steady, detached, like it didn’t care what was about to happen.\n\nShe turned her head—just slightly.\n\nThat’s when she saw them.\n\nBodies.\n\nAt least five others, laid out on parallel gurneys. Some without life. Some with a little life left in them, moaning softly. One was already... open. A woman’s torso, split down the middle, her chest cavity hollowed out like something in a butcher’s freezer.\n\nMima’s stomach twisted. A girl who wasn’t even capable of hearing a scolding from her father had to witness this, this was too extreme for her.\n\nBehind a plastic divider, a man in a scrub cap and visor held a tray filled with organs—carefully arranged, labelled in ziplock bags. Liver. Kidneys. Eyes.\n\nThen she saw the table beside her gurney—already prepped with tools. Scalpel. Forceps. A bone saw.\n\nAnd the man next to it.\n\nHe wasn’t like the masked pirates. This one had a surgeon’s stillness. He checked her vitals with the casual efficiency of someone watering a plant. Then he reached for a small syringe from a metal tray—likely to knock her out again.\n\nMima’s throat felt like sandpaper, but she forced out a sound.\n\n“Why... why are you doing this...?”\n\nThe man paused.\n\nHe turned his head, slowly, looking at her through the foggy visor. For a moment, he just stared. Then he tilted his head—not with sympathy, but curiosity. Like she was a lab rat that had spoken.\n\n“Because,” he said, his voice calm, matter-of-fact, “every part of the human body is worth something.”\n\nHe leaned closer.\n\n“A kidney? Fifteen grand. Corneas, five. Livers, more if they’re clean. Bones, marrow, skin—all cataloged, all paid for. You’re not a person here. You’re inventory.”\n\nThen, without breaking eye contact, he added:\n\n“And ten bodies? That’s over five hundred thousand dollars in one night.”\n\nHe tapped the syringe to remove the air bubble.\n\n“Don’t worry,” he murmured, almost kindly. “You won’t feel a thing. That part’s not profitable.”\n\nMima’s heart thudded, hard and fast, as the needle inched closer.\n\nThe cold tip of the syringe hovered inches above her arm.\n\nMima’s breath caught in her throat. Tears were flowing through the sides of her eyes.\n\nShe was mourining her own death, that itself is a strange feeling no 19 year old should ever experience. She had completely accepted what was supposed to happen now.\n\nShe was now bracing herself for the pain that was about to come.\n\nAnd then—\n\n“Stop.”\n\nThe word cut through the room like a blade.\n\nEveryone froze.\n\nThe surgeon’s hand jerked back instinctively, his face suddenly pale beneath the visor. The assistant by the tray stepped away like he'd been burned.\n\n“She’s mine.”\n\nThe voice was calm, composed—but behind it was something absolute. Not pleading. Not bargaining.\n\nCommanding.\n\nBoots clicked against the floor.\n\nMima could barely turn her head, but she saw them all look toward the doorway. The masked surgeon lowered his head like a child caught doing something forbidden.\n\nThen the figure appeared in the sterile light.\n\nThe captain.\n\nStill in black. No surgical gear. No mask. Just a long coat wet from sea mist, and eyes that burned like something that had seen war, and worse.\n\nHe stepped into the operating room as if it were his own dining hall.\n\n“Unstrap her.”\n\nThe surgeon hesitated. “But—Captain, she was next—”\n\nThe captain’s gaze locked onto him. Just once.\n\nThe man said no more.\n\nHands moved quickly. The straps were undone, the IV pulled from her hand. Mima's arms dropped limply to her sides, too weak to move, too dizzy to speak. Her vision blurred—but the captain didn’t look at her like a savior. He looked at her like... property.\n\nHe signaled, and two crew members wheeled her gurney out of the surgical chamber. She saw more  bodies as she came outside the plastic dividers. Some still alive. Most not. She was finally wheeled out of the room.\n\nThe halls beyond were darker, quieter. The hum of machinery faded into the endless drone of waves outside.\n\nEventually, the gurney stopped.\n\nThe captain dismissed the crew with a single gesture. Then he turned to her, alone.\n\n“You weren’t supposed to be on that dock, Mima,” he said softly.\n\n“But now that you are...”\n\nHe crouched beside her, lowering his voice. \n\nShe realised who he was! He was the same man who handed her the orange, the same man whom she saw earlier! But something about him was off this time. He significantly seemed less human. As if there was only flesh and blood in him, no soul. At least that could be associated with human like kindness and empathy, not that it was shown in their earlier encounter but what small amount that was visible was now seemed lost. Absent.\n\nHis voice was deep and commanding.\n\n“This ship doesn’t sail near any map. It doesn’t need to. We collect, we deliver, we profit. But you...”\n\nHis fingers brushed the side of her face—gentle, almost reverent.\n\n“You’re not going anywhere. Not until I decide what you’re worth.”\n\nHe stood up and walked toward the door.\n\n“You should rest. You’re not scheduled for processing.”\n\nNot yet, she heard in the silence that followed.\n\nThe door clicked shut.\n\nAnd she was alone.\n\nStill alive.\n\nStill trapped.\n\nSomewhere far beyond the reach of help.\n\nSomewhere the sea didn’t speak her name.\n\n\n\nThe silence in the room was thick—too thick—until it wasn’t.\n\nMima stirred. Her wrists ached.\n\nShe looked down at her body.\n\nRed lines. Bruised skin.\n\nThe straps had left deep marks—angry imprints that told her she’d been held down for days, not hours. She tried to sit up, but her limbs quivered violently beneath her. Her knees buckled the moment she put weight on them, and she crumpled back onto the bed, gasping.\n\nThen came the sharper pain.\n\nHunger.\n\nNot just the discomfort of missing a meal, but the aching, deep kind—like her stomach was gnawing at itself. Her tongue was dry, her lips cracked. She hadn’t eaten. Not in days.\n\nShe tried to recall time, but it slipped like oil through her fingers. Was it three days? Four? She couldn’t tell.\n\nHer eyes blurred again. Her heart raced. Panic rose in her throat—\n\nAnd then the door opened.\n\nHe was back.\n\nThe captain.\n\nNo footsteps this time. Just presence.\n\nHe stepped into the room holding a metal tray. An IV bag swung gently from a portable stand he wheeled in behind him. On the tray: a tin cup of thick, pale-gray porridge, the kind you couldn’t name by flavor, and a syringe prepped to pierce.\n\n“You’ll feel worse before better,” he said, voice steady. “That’s the poison leaving.”\n\nShe recoiled slightly, but her body barely responded.\n\nHe didn’t ask. He took her arm and rolled up the sleeve. His grip wasn’t cruel—but it wasn’t gentle either. Familiar. Efficient.\n\n“This will sting.”\n\nThe IV needle pierced her skin in one clean motion. A cold flush of liquid moved up her vein—saline, antibiotics maybe. A dull burn followed, and with it, clarity.\n\n“You were all given something,” he continued, adjusting the drip. “It wasn’t meant to kill you. Only to make you quiet. Too weak to fight. Slow to think.”\n\nHis eyes met hers now.\n\n“They don’t care if you’re scared—just as long as you don’t scream when they cut.”\n\nHe said it without flinching.\n\nShe blinked at him, trying to speak—but her voice cracked under the weight of thirst.\n\nHe picked up the tin of porridge, stirred it once, then brought the spoon to her lips.\n\n“Eat,” he said.\n\nShe didn’t move.\n\n“If you don’t, your body’s going into another kind of shock. And you’ll never make it to tomorrow.”\n\nHis tone wasn’t cruel, but neither was it kind.\n\nIt was certain.\n\nSo she obeyed. The porridge tasted like salt, metal, and something faintly floral—almost perfumed. Not sweet. Not savory. Just... strange. But it sat warm in her gut, and after a few spoonfuls, her head didn’t feel like it was spinning anymore.\n\nHe watched her.\n\nNot leering. Not even with curiosity.\n\nMore like someone inspecting the stability of a system.\n\nThen he said, “My name is N, I am the captain of this ship”.\n\nMima nodded slowly. The numbness in her hands was fading.\n\nShe glanced up at him, wary. “Why are you helping me?”\n\nHe didn’t answer right away.\n\nInstead, he took the tray, set it aside, and moved toward the door.\n\nThen, just before stepping out, he said quietly:\n\n“Because I do what I want, I don’t have to give you reasons for my choices, for now I have decided that I will not let you be hurt on my watch”, his words had authority, and it felt as if the world was his and he alone decides who lives and who dies.\n\n\n\n“I will be back in an hour, I want to check you for any injuries that need to be taken care of immediately. Finish the food, it takes a crew of hundreds of men and tons of fuel to make sure that people who are allowed to live on my ship get their food. I will not keep you alive if you become difficult to keep alive”, his words had logic in them, it felt he was going out of his usual self in trying to keep her alive. It was becoming more and more clear that he had never been kind to anyone in his entire life.\n\nThe door clicked shut. She was now alone in this room, which was nowhere as comfortable as home but was not as gruesome as the operating table she was on few minutes back.\n\nAnd for the first time since the mist rolled in, Mima felt something else—\n\nNot hope. Not safety.\n\nBut a strange, unbearable relief.\n\nAs if the devil had pulled her from the fire—\n\nOnly to keep her for himself. She felt chosen. \n\nThe door opened again after some time. N was back, this time in a white t-shirt , which seemed to be wet with ocean mist and stained with black grease of the ship’s engine, seemed like he had gone to fix something himself in the engine, or perhaps any other part of the ship in this last hour.\n\nN seemed efficient and intelligent, the way he talked about food, it was clear how he looked at things that were under his command in the ship.\n\n“Strip”, he commanded suddenly, Mima was taken aback. She hadn’t even recovered properly form the shock of being almost killed and here she was in front of a total stranger being told to get naked.\n\nHe stood there patiently, not moving closer to her, looking at her like an owner looks at a new pet when they first adopt them.\n\nShe tried unbuttoning herself but was too weak, she hadn’t fully recovered from the trauma to understand right from wrong. She would have questioned his motives if her body had proper nutrition, her mind had become too weak.\n\nN went right ahead and started unbuttoning her top, he striped her panties, and bra. She was leaning on him, not in an endearing way or romantic way but because she was too weak to keep herself straight, he was pulling away, tring not to touch her skin too much. Mima was confused.\n\nAfter making her naked, he stepped a two steps back, to inspect the marks on her body, he was turning and checking her limbs, her back and her neck, with almost no emotions at all, as if a butcher checks meat.\n\nHe caught her expression and spoke curtly, ''Shock masks pain. Neural damage goes undetected when the body's in prolonged trauma. Physical examination was....... necessary.'' He turned away and threw her clothes back at her. ''Get dressed.'' \n\nShe felt weird, she was expecting someone to consume her , she wasn’t approving of it, but she still wasn’t expecting to be treated like this. A pet, nothing more.\n\nHe noticed that she was having difficulty in putting back her clothes, he noticed it, he helped her to get dressed again, trying to make sure that he didn’t touch her skin any-more than what was required. He was trying to keep her dignity intact. It was finally sinking deeper in her that this man wasn’t there to harm her in any way, why was he keeping her alive, was still a mystery to her.\n\n\n\n“At least I am not dead”, she said to herself.\n\nAt this point of time she felt sturdy in her current position. Weak in body, yes—but not in spirit. Not anymore. Now she felt as if a pet rabbit of a lion , he can devourer her any moment he wanted, but he didn’t and on top of that he protected her from a certain death and was keeping her well fed. For now.\n\nAt times life throws a curve ball at us, we don’t know how to react, we face things we have never faces before, such things happen with everyone, a person is lucky if they are facing something like this on a smaller scale, Mima’s entire life was turned upside down.\n\nChapter 4\n\nDays passed—or maybe just one. Time didn’t exist here the way it used to. The room remained dim, always lit by a weak yellow lamp that never turned off. She was given more food, some kind of protein broth this time. An IV bag was replaced silently in the night. Someone had been there while she slept—but she never saw them.\n\nExcept him.\n\nCaptain N came once a day. Never spoke more than a few sentences. Sometimes asked how she felt, sometimes didn’t. He brought the food himself. Adjusted the IV. Never sent anyone else.\n\nHe was always clean. Crisp. Not like the others. His long coat buttoned to the throat, gloves always on. There was something about him that made the room shift, the air rearrange itself to accommodate his presence.\n\nShe started to look forward to the sound of the latch unlocking.\n\nAt first it was just survival.\n\nBut then...\n\nShe caught herself watching him.\n\nThe sharp line of his jaw when he turned away. The quiet confidence in the way he moved. The faint scar running beneath his right eye—like a single line of ink in a blank book. The way he never looked at her like the others did, not even for a moment.\n\nWhen he handed her the food, his fingers brushed hers. Just once. Her breath hitched.\n\nShe didn’t know what was happening. She’d been abducted, drugged, strapped down to die.\n\nAnd yet here she was, in a corner of the ship no one else dared come to, drinking hot broth from the captain’s own hands, her heart beating in her throat every time he stepped in.\n\nWhat was wrong with her?\n\nThe guilt crept in.\n\nAt night she would curl into herself, her thin blanket pulled to her chin, and remember home. The smell of fresh-cut fruit, her sister’s earrings in the sink, the rhythm of street music by the old square.\n\nBut the memories didn’t hurt like they used to.\n\nWorse, they felt distant. Faded.\n\nAnd when she closed her eyes, it wasn’t her mother’s voice she heard, or her best friend’s—it was his.\n\n“Because I do what I want. I don’t have to give you reasons for my choices.\n\nFor now, I’ve decided I won’t let you be hurt on my watch.”\n\nHe hadn’t said it kindly. He’d said it with authority, like a king. Like a god.\n\nAnd it made something in her stomach twist in a way she didn’t understand.\n\nWhy had he saved her? Why her?\n\nShe had asked once, timidly, on the third day, when her body could hold itself upright again. He had tilted his head at her like one might regard a curious animal.\n\n“Why?” he repeated, lips curled slightly. “You really want to know why?”\n\nShe nodded, though her voice didn’t come out.\n\nHe leaned in—not close, just enough that his shadow passed over her.\n\n“Because I felt like it,” he said, and walked away.\n\nNo warmth. No promise.\n\nAnd yet she clung to those words like scripture.\n\nHer shame grew with every passing hour.\n\nHow could she feel this… comfort? How could she feel safe, even grateful, aboard a ship that had nearly harvested her like livestock?\n\nShe should be screaming. Plotting escape. Mourning.\n\nInstead, she waited each morning for the click of that lock, heart stammering like a child caught with a secret.\n\nShe didn’t know what this was.\n\nBut she knew one thing:\n\nShe wasn’t afraid of him anymore.\n\nAnd that terrified her more than anything.\n\nChapter 5\n\nShe didn’t ask for much.\n\nJust a few steps. A breath of real air. A glimpse of the sun—if it even existed out here.\n\nShe waited until he entered, the way he always did—measured, precise, his boots echoing softly on the steel floor. He brought a folded cloth this time. A fresh change of clothes.\n\nShe took it from his hand, steady now. Eyes level with his.\n\n“I want to walk,” she said. “Just on the dock. Just a little.”\n\nHe studied her in silence. The pause stretched. She could feel the weight of his judgment pressing into her chest, but she didn’t flinch.\n\nAt last, he gave a single nod.\n\n“Stay on the main deck. Don’t talk to the crew. And don’t try anything stupid.”\n\nThen, as he turned to go, he added without looking back—\n\n“You’ll find the sunrise better on the east rail.”\n\nShe found it hard to believe at first—how much she’d missed the color blue.\n\nThe sky was clearer than she expected, open and endless. The sea below stretched like liquid glass, with no sign of land in any direction. No birds. No horizon. Just movement.\n\nHer legs were still sore, her steps uncertain, but the wind hit her face and her lungs drank it in like medicine.\n\nThat first day, she just stood at the rail, hands gripping the cold metal, tears slipping down her cheeks before she even knew they’d formed.\n\nNo one spoke to her. No one came close.\n\nShe wasn’t one of them. Not crew. Not prisoner.\n\nShe was his.\n\nDays passed. \n\nShe didn’t ask for a clock, didn’t ask where they were going. She didn’t want to know.\n\nEach morning, she walked the main deck. At first slowly. Then with more confidence. The creak of the wood, the salty air, the rhythmic hum of the ship’s massive heart—it became her ritual. Her tether.\n\nHe gave her the access to the kitchen and she now met the old chef and his 12 year old helper, they seemed to be ordinary folks who were taken by N from a warstrucked island, if he hadn’t taken them in they would have died for sure, this made her even more intrigued about the kind of man N was.\n\nThere were parts of the ship that were off-limits—clearly marked, guarded by doors that didn’t budge. But oddly enough, his cabin wasn’t one of them.\n\nShe never dared go in when he wasn’t there, but once, she found the door slightly ajar. Inside, it was nothing like the cold clinical rooms she’d seen. It was… alive. Wood-paneled walls, old maps rolled into glass tubes, a low shelf of thick books bound in red and black leather. A bed that had never once been slept in.\n\nSometimes, she thought he left the door open on purpose.\n\nSometimes, she thought he was watching her through it.\n\nHer fascination turned to obsession.\n\nShe thought of him constantly.\n\nHow he stood, arms crossed, watching the sea. How he never raised his voice, but when he spoke, everyone moved. How the crew parted around him like a current around stone. How he never smiled.\n\nShe began inventing excuses to speak with him.\n\nShe asked what the engine room looked like. She asked if the stars were different out here. She asked what he read at night.\n\nHe rarely gave full answers. But he never pushed her away.\n\nOne evening, she knocked on the open door of his cabin.\n\nHe looked up from a chart he was studying.\n\n“I brought you tea,” she said. “I thought captains drank tea.”\n\nA ghost of a smirk passed his lips, then vanished.\n\n“Drinking, eating, everything, I do what I want, when I want, no one in the world should drink tea because of a custom” he said, but he took the cup from her hand.\n\nShe hated this new version of herself sometimes.\n\nHated that the nightmares were fading. That her memories of the misty street, of the frozen people, of the surgical table—were losing their sharpness. She did remember her family though, but she had a bitter sweet satisfaction of them never going through what she went through, she wasn’t sure if they would survive or if N would have mercy on them like her.\n\nHer past almost seemed like a chapter from the book of her life that was now over. \n\nThis was a new beginning , something that was new, fresh, and something that took her in, not by choice though, but still she felt as if she was the new rose in this valley of thorns, and she enjoyed her position very much. She looked at herself as the colour in this grey world. \n\nHuman beings find a reason to find happines whereever they go, they can also find misery whereever they go.\n\nBut here, she had no other choice, her old idea of happiness was now being replaced by new ideas, her old normal was being replaced by new normal.\n\nWhat was replacing them?\n\nThe rustle of maps. The sound of boots on wood. The scent of whatever cologne he wore—bitter and expensive.\n\nShe didn’t know who she was turing into anymore.\n\nBut she knew she was becoming someone new.\n\nAnd in the center of that change, like the eye of a storm, was him.\n\nChapter 6\n\nThe night was colder than usual.\n\nMima stood at the east rail, arms wrapped tightly around herself, watching the moonlight turn the waves into molten silver. The wind bit at her skin, but she didn’t move. Not until she heard the footsteps.\n\nShe didn’t have to turn to know it was him.\n\n“You shouldn’t be out here this late,” he said quietly.\n\n“I couldn’t sleep,” she replied.\n\nSilence fell between them, thick and weighted.\n\nShe turned, eyes meeting his—really meeting them. For the first time, he looked back and didn’t look away.\n\n“I don’t understand you,” she whispered.\n\n“You don’t need to.”\n\n“But I want to.”\n\nHe stepped closer, and for once, there was no distance, no cold professionalism, no wall.\n\n“I owe you my life,” she said. “And I hate that I feel safe around you. I hate that I don’t miss home. That I think about you all the time. That I wonder what you're thinking when you look at me.”\n\nHe was inches from her now.\n\n“You shouldn’t,” he said, voice low. “This place changes people. I am not who you think I am.”\n\n“I don’t care.”\n\nShe didn’t know who moved first.\n\nMaybe it was him. Maybe her. Maybe it was the ship itself shifting beneath their feet, forcing them together.\n\nBut suddenly his hand was on the side of her face, fingers tangled in her hair, and her lips were on his—desperate, trembling, unsure if she was allowed to want this but needing it anyway.\n\nThe kiss was not soft. It was not sweet.\n\nIt was fire meeting ice. Hunger meeting restraint. Her hands gripped his jacket like she might fall without it, and for a second, he allowed it—he allowed her.\n\nThen, just as quickly, he broke it.\n\nPulled back. Breathing hard.\n\nHis thumb still on her cheek, his voice like stone:\n\n“This changes nothing.”\n\nAnd then he turned. Walked away.\n\nLeft her standing there, heart racing, lips burning, head spinning.\n\nHe went to his cabin, Mima followed, not knowing where to this journey might be leading.\n\nAs she stood there, she couldn’t stop herself from wanting to be near him, she controlled her hands but somehow they were wrapped around his arm. He used same arm to pick her up, and bring her closer to himself, he moved her hair and kissed her neck, Mima couldn’t stop herself and her entire body shook in pleasure, it was sort of something that she was craving since so long. \n\nShe held on to both his shoulders, he took off her panties and started caressing her pussy, while they both were kissing each other with deep delved passion that was being longed for by both of them.\n\nHe then took his pants off, and Mima went and grabbed his dick, and started stroking it, after a few strokes she bent down and took put it in her mouth, she could feel his hard cock inside her mouth, it was exhilarating for her. She kept sucking him while N was running his fingers through her hair.\n\nHe then picked her up, took off her bra and every bit of clothing she had, he had this animalistic raw feel to him this time, Mima felt desired. He took her to himself and inserted his rock hard cock inside her , all at once, Mima gasped, she could feel him inside her, and he started fucking her, while she couldn’t stop herself from moaning. He covered her mouth with his thick hand with thick palms, she was almost screaming with pleasure but bareley any sound was coming out because of his grip.\n\nHe took out his cock from her vagina and leaned to her ear while almost garbing her pussy and whispered in her ear, “this belongs to me”.\n\nHe made her lean over and started penetrating her pussy from behind, then he picked her leg up and almost fucked her in such a way that each thrust was being felt not just in her vagina but in the rest of her body too, the force was just perfect.\n\nHe then made her sit on her knees and instructed her to start stroking him, just when he was about to cum, Mima was ready to be ejaculated all over her, she was anticipating it with every stroke and suck, he stopped and told her stop, he leaned in and said,”not yet, you’ll have to wait”.\n\nSaying this, he gave her her clothes, and started dressing her, but this time, it was different, he was grabbing her, his hands were squeezing her breasts, his palms were grabbing her ass, it almost felt a complete contrast as compared to what she experienced on her very first day.\n\nAnd for the first time since she boarded this cursed ship—\n\nMima didn’t feel like a prisoner.\n\nShe felt claimed.\n\n\n\n\n\nThe morning after was silent.\n\nThe morning after, Mima awoke alone in the captain's cabin. The sheets were still warm, the scent of him lingering in the air. She sat up, her body aching, not from pain, but from the intensity of the night before. The intimacy they shared was powerful, yet incomplete—he had stopped midway, he didn’t ejaculate, leaving her yearning and wanting more and more of him, she wanted to taste him to the fullest.\n\nNo whispers. No footsteps. No sounds of the crew or the wind. Just the quiet hum of the ship and the soft ache in Mima’s limbs, like the sea itself had rocked her to sleep and forgotten to let go.\n\nShe lay in his bed, the sheets still tangled around her legs, her skin still warm where he had touched her. But the space beside her was empty. Cold. As if he’d never been there at all.\n\nNo trace of him remained in the room—not a jacket, not a scent. Only the memory.\n\nThe way he’d looked at her, like she was something he was stopping himself from experiencing. The way his hands felt as if they were longing to toch her in this way. The way he had pulled her close in the dark, consumed her like a man who had run out of ways to stop himself from doing so.\n\nIt almost felt like she was the one who won him over and he couldn’t stop himself anymore form being weak towards her.\n\n\n\nBut Mima too was not what she had been till now.\n\nShe didn’t know who she was in those hours. Just that she had wanted to be seen. To be held. And he had done both.\n\nBut now, with the sunlight spilling through the narrow porthole and the sheets turning to weights across her skin, a knot had formed in her chest.\n\nTo her it was a version of him that was unseen till now.\n\nWas this mercy?\n\nOr just another form of captivity?\n\nShe sat up, pulling the blanket around her like armor. Her body ached—not just from the night, but from everything before it. The hunger, the fear, the near-death numbness. And now—this.\n\nIt should’ve felt like a release but it felt like a release.\n\nThere was a knock. Not at the cabin door. Somewhere deeper inside her, like a question she couldn’t answer.\n\nWhat did this mean?\n\nHad she crossed a line—or been pulled across it?\n\nLater that day, she saw him again. On the upper deck. Standing still, arms behind his back, watching the horizon like it owed him something.\n\nWhen he turned to her, his face was unreadable.\n\nNo smile. No anger. Just the same calm, deep silence he wore like a uniform.\n\nHe gave her a small nod. Nothing more.\n\nAnd then walked away.\n\nAs if nothing had happened.\n\nBut everything had.\n\nThat night, she lay in her own room. Alone again. The sheets too clean, the air too dry. She couldn’t sleep. Not because of what had happened—but because of what hadn’t been said.\n\nShe didn't know what she was to him now.\n\nBut she knew what he had become to her.\n\nNot savior.\n\nNot captor.\n\nSomething in between.\n\nSomething far more dangerous.\n\n\n\nShe wrapped the blanket around herself, trying to make sense of her emotions. There was a strange comfort in his presence, a sense of safety she hadn't felt since her abduction. Yet, there was also a growing obsession, a desire to understand him, to be close to him.\n\n\n\nOver the next few days, Mima tried to regain some emotional control. She resumed her walks on the deck, seeking solace in the vastness of the sea. She avoided the crew, focusing instead on the horizon, hoping to find clarity.\n\nBut her thoughts always drifted back to him. His presence, his touch, his voice—they haunted her. She found herself drawn to his cabin, lingering outside, hoping for a glimpse of him.\n\nOne evening, as the sun dipped below the horizon, she noticed a ship in the distance. It was stationary, its sails furled, with almost same black marks with skulls on its flags as she had seen on the mast of N’s ship. It had the same haunting feeling. She alerted the crew, but they dismissed her concerns. The next day, the ship was gone.\n\nA few days later, another ship appeared, or maybe it was the same ship but closer. The crew sent a warning as a cautious transmission, but there was no response. The ship remained still, watching. This was an extreme overwhelmness for her, she felt as if there was something evern darker that existed out there. The little comfort of known she had started to feel lately, suddenly was being wiped away from the sudden enterence of the unknown. The ship got covered in mist, this was almost same as the mist she saw back but this was something dark, it felt like as if they were the evil ones of the evil world. After the mist went away the ship was no where to be seen. \n\nMima couldn't shake the feeling that something was coming. She felt a growing unease, a sense that their isolation was about to be shattered.\n\n\n\nChapter 7\n\nThe mist had long vanished, but it left a shadow behind—a dense unease that clung to the walls of the ship and settled deep into Mima’s chest. She had barely slept the next 2 days. Every sound felt like a signal, every creak of the ship’s hull a warning.\n\nShe went to his cabin that night, uninvited but expected. He didn’t ask her why she was there. He only looked at her—really looked—then closed the door behind her.\n\nShe trembled, not from fear, but from the strange emotion brewing inside her—equal parts terror and need. And he understood. Without a word, he held her. Not gently. Not roughly. Just surely, like he was anchoring her to something solid in a world that had gone fluid.\n\nWhen he undressed her, it wasn’t hunger. It was command. She responded with equal intensity, gasping under the weight of his control. His body was firm, deliberate, and when he kissed her, it was not for pleasure. It was for power. It was for presence. It was to silence the war raging inside her.\n\nThey didn’t speak. Not during. Not after.\n\nOnly the sound of her breath, ragged and real, and his heartbeat steady against her ear.\n\nHe wasn’t going to finish this time too. He pulled away before the final moment, just like before. But Mima knew what was about to happen, she grabbed and pulled him in with her legs, she wanted to make sure that all of him was released inside her this time. He didn’t question it this time. He knew what she desired and felt it was high time he gave her what she wanted. She simply lay there, eyes open, staring at the ceiling as his warmth lingered on her skin.\n\nAnd then—\n\nThe sound of silence.\n\nIt was too quiet.\n\nNo engine hum. No waves slapping. No wind.\n\nShe sat up.\n\nHe had already gotten out of bed. Standing by the small round window, his body tense. Unmoving.\n\nShe wrapped a sheet around herself and walked to him. “What is it?”\n\nHe didn’t answer. His eyes were fixed on the horizon.\n\nOutside, everything had stilled. The crew wasn’t shouting. No one moved. The ship was breathing—slow, shallow.\n\nThen came the sound.\n\nA single, distant thump—like a giant heartbeat from under the sea.\n\nBoom.\n\nAnother one.\n\nBoom.\n\nAnd then, chaos.\n\nA flare cut through the sky, burning red like blood on moonlight. Sirens wailed. Metal clashed. Shouts broke out. Footsteps pounded above.\n\nCaptain N turned to her, voice low but burning. “Stay here. Do not come out. No matter what you hear.”\n\n“What’s happening?” she asked, her voice shaking.\n\nHe grabbed his coat, strapping a knife to his belt. ‘I am the captain of this ship, it is not it’s shields and it’s armour that protects it, it is me, and those sounds of cannon being fired to it, is the sound of me being called for my duty.’\n\nThen he was gone.\n\nShe ran to the window.\n\nThe enemy ship had returned.\n\nBut it no longer looked like a ship.\n\nIt looked like a monster.\n\nDark sails. Torn, yet full. Black flags with symbols she didn’t fully recognize. Cannons lining its side like a row of open mouths. Along with machine guns and modern greande launchers.\n\nAnd then—\n\nIt fired.\n\nExplosions rocked the hull beneath her feet. Flames licked the edge of the sky. Screams echoed. Steel rang against steel.\n\nThe sky cracked open.\n\nAnd the sea turned red.\n\nThe first cannon hit somewhere below her. The entire floor shook like it was alive—screaming.\n\nMima was thrown to the ground, hitting her elbow on the edge of the bunk. She didn’t even feel the pain—just heard the whistle of air being torn apart as another shell blasted into the lower decks.\n\nOutside her window, the enemy ship had come even closer.\n\nBut no one was shouting commands over there.\n\nNo chaos.\n\nNo panic.\n\nJust movement—calm, terrifying movement.\n\nThey weren’t shouting because they didn’t need to. Everyone on that ship knew what to do. The cannons fired in perfect rhythm. Reload. Aim. Fire. Repeat.\n\nMachine guns cracked in short bursts, slicing through the air like razors. Grenades arced through the mist, landing on N’s deck with violent thuds—each one followed by fire and screaming metal.\n\nMima watched in horror as one of N’s men tried to man a mounted gun. A single shot from the enemy tore straight through him—his body folded in on itself like paper, blood painting the walls.\n\nAnother sailor ran up to take his place before the body even hit the floor.\n\nOn the enemy ship, when someone fell, someone else immediately filled their space.\n\nNo words.\n\nNo hesitation.\n\nAs if the battle had been practiced. Rehearsed.\n\nOr worse—foreseen.\n\nMima ran to the door but it got somehow jammed because of the cannon fired at the ship. She banged against it, yelling his name.\n\n“N! Let me help you!”\n\nShe knew he was the one who can do the actual help, there was nothing she could do. He was the protector, he was the master and he was the captain of the ship. \n\nBut something in her wanted to protect him too, something inside her knew that she wont ever be complete if she doesn’t give her everything to him just like he was putting his life on the line to protect her and everyone of the people who was under him on his ship.\n\n“N, do not go alone without me”, she shouted again.\n\nBut there was no answer.\n\nSmoke began to pour in through the cracks in the wood. Somewhere below, something had exploded. Her lungs burned. Her vision swam.\n\nAnd then, the ship tilted.\n\nShe was thrown sideways, slammed into the dresser.\n\nShe crawled up to the window again—just in time to see one of N’s crew being dragged across the deck, the crewman’s leg missing, still screaming.\n\nAbove him, a grappling hook slammed into the wood—followed by boots.\n\nThe evil from another ship was boarding.\n\nThe enemy wasn’t just attacking from afar now.\n\nThey were coming on board.\n\nAnd they weren’t dressed like pirates.\n\nThey wore masks—no faces. Helmets with black visors. Tactical suits. Not chaos—command. Not hunger—mission. They were humans but lacked any feelings, or so it seemed. At least N’s men seemed cruel in comparison, these ones seemed heartless, literally!\n\nOne by one they landed, fanning out with weapons drawn. Clean. methodical.\n\nMima’s eyes darted across the deck, searching—\n\nAnd then she saw him.\n\nCaptain N, sword in one hand, pistol in the other, moving through the smoke like death in black.\n\nHe wasn’t giving orders.\n\nHe was taking lives.\n\nHe shot a boarder in the throat, spun, slashed another across the chest. He moved like he knew the battlefield before it happened—like the violence was a language only he spoke.\n\nBut even he couldn’t hold them all back.\n\nThere were too many.\n\nAnother blast. This time, the enemy used incendiary grenades.\n\nFire spread across the sails, licking the ropes. More of N’s men fell. Some were screaming. Some were already silent.\n\nAnd still the enemy came.\n\nOne of them leapt from a higher mast and landed behind N.\n\nHe turned just in time, shooting him point-blank in the visor.\n\nThe helmet cracked—bone and metal splintering together.\n\nBehind it: a face.\n\nEyes wide in shock. Mouth frozen mid-scream.\n\nBlood poured out like thick red oil.\n\nThe enemy staggered, twitched—\n\nthen collapsed.\n\nAnother stepped over his body without hesitation. \n\nMima backed away from the door, shaking, her hands bleeding from clawing at the lock. She couldn’t tell if the blood was hers or someone else's.\n\nBut with someone like N standing there, she knew, there was not a thing in the world thact could touch her. She was always the second in the harms way, N was first. And nothing in the earth could have its way with him. He was invincible.\n\nBut deep down, she feared—\n\nThis might be the last night the ship ever sees the dawn.\n\n\n\nChapter 8\n\n\n\nThe deck was chaos.\n\nSlick with blood, littered with ash and metal, the screams of dying men tangled with the hiss of fire and the clash of steel. Captain N stood in the center of it all, his coat torn, one eye bloodied, sword swinging wide as he fought like a man possessed.\n\nHe had no time to breathe.\n\nNo time to mourn the ones he saw fall.\n\nNo time to feel the sting of the wounds on his body.\n\nHe was still standing because the ship—his ship—was still breathing.\n\nBut barely.\n\nThe enemy wasn’t stopping. Not even slowing. They just kept coming. Silent, coordinated, unstoppable.\n\nIt wasn’t until he saw how they moved—protecting someone—that he realized:\n\nThere was a leader. Hidden.\n\nA figure cloaked in shadows, walking slowly across the deck while others fought and died to clear the path.\n\nEven in the madness, the enemy’s formation shifted—adjusted—like a living thing, making space for that one figure.\n\nAnd then—\n\nBoom.\n\nN’s head snapped toward the sound.\n\nThe blast came from the upper deck.\n\nHis cabin.\n\nHis heart jumped in his throat.\n\nHe saw fire where the walls used to be.\n\nAsh and smoke where the bed once stood.\n\nThe door blown clean off its hinges.\n\nA bazooka had taken it. His cabin was gone.\n\nHis eyes burned, not from the smoke, but from the horror in his chest.\n\nMima.\n\nHe fought harder now. Rage fueling his swings. His shoulder was torn open but he didn’t feel it. His leg was bleeding, but he didn’t slow. He killed and killed and killed—until his knees gave out and the strength drained from his arms.\n\nThey swarmed him.\n\nHe took two more down.\n\nThen three.\n\nBut a blade found his back.\n\nA boot kicked him down.\n\nAnd now, N was on the ground, breathing like a wounded animal, sword knocked from his hand.\n\nAnd then—\n\nBootsteps.\n\nNot rushed.\n\nNot heavy.\n\nJust calm.\n\nAnd then a single black boot came into view, pressing against his chest, holding him down.\n\nHe looked up—\n\n—and time stopped.\n\nShe removed her mask.\n\nMima.\n\nMima.\n\nHer hair fell out from under the helmet. Her eyes—still wide, still innocent—looked down at him.\n\nBut there was no fear.\n\nOnly silence.\n\nOnly a soft smile.\n\nHe couldn’t speak.\n\nCouldn’t move.\n\nCouldn’t think.\n\nHis mouth was dry. His jaw clenched.\n\nHis eyes, bloodshot and wild, screamed one word louder than his mouth ever could.\n\nWhy?\n\nThe betrayal didn’t stab him—it split him.\n\nIt tore through every moment they'd shared. Every look. Every touch. Every lie she fed him with trembling hands.\n\nHe had loved her.\n\nHe had saved her.\n\nAnd now—\n\nShe stood over him like a queen over her conquered king.\n\nN’s lip curled, fury and heartbreak tangled together like smoke and blood.\n\nStill, she smiled.\n\nA soft smile.\n\nThat same softness that once made him want to protect her.\n\nBut now—\n\nNow he saw it.\n\nThe mask had always been there. Her innocence had always been a weapon.\n\nAnd she had used it perfectly.\n\nThe last thing N saw before the darkness took him was her eyes.\n\nAnd for the first time, they looked honest.\n\nCold.\n\nCalculating.\n\nVictorious.\n\n\n\n\n\nChapter: A King Bleeds, But Does Not Bow\n\nTime bent.\n\nCaptain N lay there, body broken, heart torn, staring up at the face of the one he had once trusted more than the stars above.\n\nMima.\n\nHer expression—soft, satisfied, almost glowing—crushed something inside him deeper than any blade could reach. His own heart had betrayed him. His ship had been taken. His body—torn, bleeding, burnt—should have given up.\n\nBut then—\n\nShe smiled.\n\nThat smile.\n\nShe enjoyed this.\n\nEvery wound.\n\nEvery scream.\n\nEvery piece of him unraveling.\n\nShe enjoyed watching the king fall.\n\nShe walked towards him, her prized victory, she was almost so proud of the fact that she finally have taken down the lion of the deep seas. It was just a pure ego trip. Her innocence, seemed fake now. She took a step, she was aiming to crush his skull from the heel of her boot, poke the non bloody eye and end him then and there!\n\nBut as she was just about to take the last step, something monstrous inside him woke up.\n\nWith a deep, guttural roar, he slammed his bloodied hand into the deck, pushed against the cracking wood, and stood.\n\nEvery muscle screamed.\n\nEvery bone protested.\n\nHis lungs burned.\n\nHis vision blurred.\n\nBut he stood.\n\nA single sword in one hand.\n\nA rusted gun in the other.\n\nAnd an inferno in his eyes.\n\nThe enemy crew froze. None of his own men were standing anymore, some dead and some half dead.\n\nThere was this second wind that he had pulled out of the depths of hell.\n\nHe somehow had stopped death in the doorsteps of his life.\n\nLong enough for him to pull the trigger.\n\nBang. One skull shattered.\n\nThen another.\n\nThen another.\n\nHe moved like a ghost, bleeding as he danced, blade slicing through bone, bullets tearing through flesh. The world turned into chaos again, but this time it was his fire lighting it.\n\nSlash. A man screamed.\n\nThud. A body fell.\n\nCrack. A wrist was snapped in half.\n\nThey came at him from every side, like wolves sensing the end of the lion.\n\nBut N was no lion.\n\nHe was something more.\n\nDarker.\n\nHungrier.\n\nA force of vengeance wrapped in mortal skin.\n\nOne man stabbed him through the gut.\n\nN didn’t blink.\n\nHe drove his sword upward, straight through the man’s mouth.\n\nAnother bullet hit his thigh.\n\nHe turned, shot two at once.\n\nHis hands were soaked, trembling, cut to the bone.\n\nAnd still he moved.\n\nAnd still he killed.\n\nUntil there were none left.\n\nSilence fell like ash.\n\nThe deck was littered with the dead.\n\nAll except one.\n\nShe stood across from him, alone now. Mima.\n\nNo pirates to protect her.\n\nNo mask.\n\nNo lies left to hide behind.\n\nOnly the truth.\n\nOnly her.\n\nHe looked like a corpse already—body slashed in a hundred places, his coat in tatters, the white of his ribs peeking through torn flesh. Blood dripped from his mouth, his leg dragged behind him, his eye was almost shut.\n\nAnd yet—\n\nHe took a step.\n\nThen another.\n\nDrag.\n\nThe sword scraped along the floor behind him like a gravestone being carved.\n\nClink.\n\nThe gun hit the deck, empty, but he no longer needed it.\n\nStep.\n\nStep.\n\nDrag.\n\nHe didn’t speak.\n\nThere were no words left.\n\nOnly the sound of death approaching slowly.\n\nMima couldn’t move.\n\nCouldn’t breathe.\n\nFor the first time, she was afraid.\n\nHis breaths were shallow now.\n\nHis arms trembling.\n\nEach step a war.\n\nBut still he came.\n\nThe devil she thought she’d buried had crawled out of his grave.\n\nOne final step.\n\nHe stood before her now.\n\nTowering.\n\nBleeding.\n\nBarely alive.\n\nBut still standing.\n\nThe sword raised slowly, shakily.\n\nAnd his eyes met hers—There was pure hate and need to destroy the other person completely now, N was almost halfway dead. Mima stood there, with a sharp balde in her hand now almost ready to finsh off what the rest of her people had started and almost completed.\n\nAnd the cold certainty of justice.\n\nN stood—barely. His ribs exposed, his body torn open by a hundred blades and bullets. The floor beneath him slick with blood. He had already defeated death once tonight. Now it waited again, close… eager.\n\nAcross from him stood the girl he’d risked everything for.\n\nThe girl who he had once saved from the clutches death, who bared her softness in his arms, clung to him like he was the last light in her world.\n\nNow she held a blade.\n\nNow she smiled.\n\nMima took a step forward.\n\nHe didn’t move.\n\nHe couldn’t.\n\nHer sword cut through the air and slashed across his chest.\n\nHe stumbled, knees buckling, a choked gasp in his throat. His hand instinctively reached out, not to strike, but as if trying to hold onto her once more.\n\nShe stepped back.\n\nCold.\n\nUnfeeling.\n\n“You always saw me like a girl you could save,” she whispered, circling him slowly.\n\nHe fell to one knee.\n\n“You were right,” she added, raising the blade again.\n\n“And you failed.”\n\nThe second slash hit deeper. Across his back this time. He dropped his sword. Gasping. His fingers scrabbled across the blood-soaked deck. His breath sounded like broken glass.\n\nShe stood over him now.\n\nA queen above her dying king.\n\nHe raised his head with effort, blood dripping from his mouth, lips trembling—but not from fear.\n\nFrom rage.\n\nFrom heartbreak.\n\nHe looked into her eyes, saw no regret, no guilt—only a twisted sense of satisfaction. That same innocence that once comforted him now felt like a mask for something far more monstrous.\n\nHe thought of all the nights he fed her, saved her, held her close.\n\nThought of how gently she had once kissed his chest.\n\nHow she had smiled when he brought her sunlight again.\n\nAnd now, that same smile… watching him die.\n\nHe coughed once. Blood spilled onto the deck. His hand touched something—his blade. Just barely.\n\nShe raised her sword for the final blow.\n\nBut he spoke.\n\nSoft. Almost tender.\n\n“Why?” he asked.\n\nMima tilted her head. “Because, hunting is only fun when its challenging, you were my perfect prey, a great challenge and now I shall relish this victory to every last bit.”\n\nAnd she drove the sword down.\n\nIt pierced through his shoulder, grinding into bone. He let out a cry—not of pain, but pure, raw fury.\n\nThen something snapped.\n\nIn him.\n\nHis hand gripped the blade beneath him.\n\nAnd with a roar that didn’t sound human—\n\nHe rose.\n\nHe swung.\n\nOne, final, monstrous slash.\n\nIt cut through her stomach, upwards, tearing cloth, flesh, ribs, and spine.\n\nShe gasped.\n\nEyes wide.\n\nMouth parted in disbelief.\n\nHe was already falling.\n\nHis voice came in a whisper, as blood poured from his lips and body and soul.\n\n“See you in hell… love.”\n\nThen she collapsed. In his arms.\n\nHe was dying, but he had tears in his eyes, maybe for the first time in his life, after being cut, broken, shot at , he actually felt pain , he actually felt hurt.\n\nThe sun was now setting, the ocean wind was now getting colder, his body was now leaving his companionship, he was sitting on his knees, while the lifeless body of his Mima stood in his arms. \n\nNo one knew when the life left him, his body set to rigor mortis in the same postion.\n\nThe sun had set, the terror of the ocean had finally taken his last breath and the story of this lion was now over."
  }